#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <time.h>

void sentence_creation(char* arr1, char* arr2, int size1, int size2) { //Фунція створення речення
    int k = 0; //Лічильник для перебору масивів речення
    int stop = 1; //Закінчення речення
    while (arr1[k] != '\0') { //Перевірка на кінець масиву речення
        stop += 1; //Збільшення лічильника на 1
        if (arr2[size2-1] == arr1[k]) {
            char temp[1000]; //Временний масив для запису речення
            arr2[size2] = ' '; //Додавання пробілу перед кінцем масиву речення

            int end = k; //Лічильник кінця речення

            while (arr1[end + 1] != ' ' && arr1[end + 1] != '\0') {
                end += 1;
            }

            for (int j = 1; k + j - 1 < end + 1; j++) {
                arr2[size2 + j] = arr1[k + j - 1]; //Додавання в временний масив початку речення всіх символів після пробілу
            }

            arr2[size2 + end + 2 - k] = '\0'; //Додавання кінця речення в масив

            for (int j = 0; j < k; j++) {
                temp[j] = arr1[j]; //Додавання в временний масив початку речення всіх символів до пробілу
            }

            if (end - k > size1) {
                temp[k - 1] = '\0'; //Додавання кінця речення в временний масив
            }

            int tempsize = k; //Лічильник для довжини временного масиву речення
            for (int j = 0; j + end - k < size1; j++) {
                temp[tempsize + j] = arr1[j + end + 2];
            }

            if (k == 0 && end == strlen(arr1) - 1) {
                temp[0] = '\0';
            }

            return sentence_creation(temp, arr2, strlen(temp), strlen(arr2)); //Повторення функции створення речення
        }

        while (arr1[k] != ' ' && arr1[k] != '\0') {
            k += 1;
            stop += 1;
        }
        k += 1;
    }

    int begin = 0; //Лічильник початку речення
    k = 0; //Лічильник для перебору масивів речення
    while (arr1[k] != ' ' && arr1[k] != '\0') {
        k += 1;
    }
    k -= 1;

    while (arr1[k] != '\0') { //Перевірка на кінець масиву
        if (arr2[0] == arr1[k]) {
            char temp1[1000]; //Временний масив на 1000 символів
            char temp2[1000]; //Временний масив на 1000 символів
            temp1[0] = '\0'; //Додавання кінця речення в временний масив

            for (int j = 0; begin+j < k + 1; j++) {
                temp2[j] = arr1[begin + j]; //Додавання в временний масив початку речення всіх символів до пробілу
            }

            temp2[strlen(temp2)] = ' '; //Додавання пробілу в временний масив

            int tempsize2 = strlen(temp2); //Лічильник для довжини временного масиву
            for (int j = 0; j < size2; j++) {
                temp2[tempsize2 + j] = arr2[j]; //Додавання в временний масив кінця речення всіх символів після пробілу
            }

            for (int j = 0; j < begin; j++) {
                temp1[j] = arr1[j];
            }

            if (k + begin > size1) {
                temp1[begin - 1] = '\0';
            }

            int tempsize = begin;
            for (int j = 0; j + k + begin < size1; j++) {
                temp1[tempsize + j] = arr1[j + k + 2];
            }

            if (strlen(temp1) == 1) {
                temp1[0] = '\0';
            }

            if (begin == 0 && k == strlen(arr1) - 1) {
                temp1[0] = '\0';
            }

            return sentence_creation(temp1, temp2, strlen(temp1), strlen(temp2)); //Повторення функции створення речення
        }

        begin = k + 2; //Збільшення лічильника початку речення
        k += 2; //Збільшення лічильника для перебору масивів речення
        while (arr1[k] != ' ' && arr1[k] != '\0') {
            k += 1;
        }
        k -= 1;
    }

    printf("--------------\n");
    if (arr1[0] != '\0') {
        printf("Рядок, щоб символ у кінці слова збігався із символом на початку \nнаступного слова, не може бути створений.\n");
    }
    else {
        printf("%s\n", arr2); //Вивід масиву
    }
}

void task_1() {
    system("clear"); // Очистка экрана
    int A[100], enter, num, n, *p, count = 0;
    printf("Введіть розмір масиву: "); // Ввід розміру масива
    scanf("%d", &n);
    printf("Ви бажаєте ввести числа вручну(1) чи обрати випадково(2)?\n"); // Вибір вводу чисел вручну чи випадково
    printf("Оберіть: ");
    scanf("%d", &enter);
    if (enter == 1) {
        for (int i = 0; i < n; i++) { // Цикл вводу чисел вручну
            printf("A[%d] = ", i); // Вивід номера елемента
            scanf("%d", &num); // Ввід числа
            A[i] = num; // Запис числа в масив
        }
    }
    else {
        printf("Масив буде сформовано з чисел від -100 до 100\n");
        srand(time(NULL)); // Ініціалізація генератора випадкових чисел
        for (int i = 0; i < n; i++) { // Цикл генерації чисел
            A[i] = rand() %201 - 100; // Генерація чисел в діапазоні від -100 до 100
        }
    }
    //Вивід масиву
    printf("A: ");
    for (int i = 0; i < n; i++) { // Цикл виводу масива
        printf("%d ", A[i]); // Вивід елемента масива
    }
    printf("\n"); // Перехід на нову строку
    //Заміна від'ємних елементів модулем
    for (int i = 0; i < n; i++) { // Цикл заміни від'ємних елементів модулем
        if (A[i] < 0) { // Якщо елемент масива від'ємний
            p = &A[i]; // Присвоєння адреси елемента масива змінною p
            *p = -(*p); // Заміна від'ємного елемента модулем на додатний елемент масива
            count++; // Збільшення лічильника замін на 1
        }
    }
    //Вивід масиву
    printf("A: ");
    for (int i = 0; i < n; i++) {
        printf("%d ", A[i]);
    }
    printf("\n");
    printf("Кількість замін: %d\n", count);
    return 0;
}

void task_2() {
    system("clear"); // Очистка экрана
    char str[1000], c; //Масив на 1000 символів та змінна для зчитування з клавіатури
    int l; //Лічильник для довжини масиву
    int amount = 0; //Лічильник для кількості символів в масиві

    printf("Введіть речення: ");
    scanf("%s", str);

    l = strlen(str); //Збільшення лічильника для довжини масиву
    do { //Перевірка на кінець масиву та пробіл
        scanf("%c", &c); //Зчитування з клавіатури символа
        str[l++] = c; //Додавання в масив символа
    } while (c != '\n');

    str[l - 1] = 0; //Додавання кінця масиву
    fflush(stdin); //Очистка буфера вводу для правильного виводу

    char arr1 [1000]; //Масив на 1000 символів
    char arr2 [1000]; //Масив на 1000 символів
    int k = 0; int i = 0;

    while (str[k] != ' ') {
        k += 1;
    }

    for (int j = 0; j < k; j++) {
        arr2[j] = str[j]; //Додавання в масив перших символів речення
    }

    for (int j = 0; j + k < strlen(str); j++) {
        arr1[j] = str[j + k + 1]; //Додавання в масив наступних символів речення
    }

    int size1 = strlen(arr1); //Довжина масиву arr1
    int size2 = k; //Довжина масиву arr2

    sentence_creation(arr1, arr2, size1, size2); //Виклик функции створення речення
}

int main() {
    printf("\n┌────────────────────────────────────────────────────────────────────────────────────────────┐");
    printf("\n│                               Лабораторна робота №4                                        │");
    printf("\n│                                                                                            │");
    printf("\n│                       Тема: «Указівники, функції, рекурсія»                                │");
    printf("\n|                                                                                            |");
    printf("\n|                                        Варіант 7                                           |");
    printf("\n│                                                                                            │");
    printf("\n│  Виконав: Данилюк Д.А., КМ-13                                         Любашенко Н. Д.      │");
    printf("\n│                                                                                            │");
    printf("\n│                                                                                            │");
    printf("\n│                                         2022                                               │");
    printf("\n└────────────────────────────────────────────────────────────────────────────────────────────┘\n");
    printf("\n1 - Написати функцію, яка замінює від'ємні елементи лінійного масиву їх модулями, не користуючись стандартною функцією обчислення модуля.");
    printf("Підрахувати кількість проведених замін.\n");
    printf("2 - Задано набір слів. Побудувати з них будь-який ланцюжок таким чином, щоб символ наприкінці слова збігався з символом на початку наступного слова.\n");
    int answer;
    printf("\nОберіть завдання: ");
    scanf("%d", &answer);
    switch (answer) {
        case 1:
            task_1();
            break;
        case 2:
            task_2();
            break;
    }
    return 0;
}
